package LW5.Task6;

/*  Напишите программу с классом, в котором есть два закрытых целочисленных поля
    (назовем их max и min). Значение поля max не может быть меньше значения поля min.
    Значения полям присваиваются с помощью открытого метода. Метод может вызываться
    с одним или двумя целочисленными аргументами. При вызове метода значения полям
    присваиваются так: сравниваются текущие значения полей и значения аргументов,
    переданных методу. Самое большое из значений присваивается полю max,
    а самое маленькое из значений присваивается полю min. Предусмотрите конструктор,
    который работает по тому же принципу, что и метод для присваивания значений полям.
    В классе также должен быть метод, отображающий в консольном окне значения полей объекта. */

public class Main {
    public static void main(String[] args) {
        MinMax obj = new MinMax(10, 5);
        obj.printValues();   // min = 5, max = 10

        obj.setValue(7);
        obj.printValues();   // min = 5, max = 10

        obj.setValue(100, -3);
        obj.printValues();   // min = -3, max = 100
    }
}
